product/load-test/results/scenario1-lock/before/run8/compare.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m20s max duration (incl. graceful stop):
              * compare: 200 looping VUs for 1m0s (gracefulStop: 20s)

time="2026-08-05T17:47:25+09:00" level=info msg="초기 재고: 99995393" source=console

running (0m01.0s), 200/200 VUs, 148 complete and 0 interrupted iterations
compare   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 243 complete and 0 interrupted iterations
compare   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 279 complete and 0 interrupted iterations
compare   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 396 complete and 0 interrupted iterations
compare   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 488 complete and 0 interrupted iterations
compare   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 633 complete and 0 interrupted iterations
compare   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 778 complete and 0 interrupted iterations
compare   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m08.0s), 200/200 VUs, 922 complete and 0 interrupted iterations
compare   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m09.0s), 200/200 VUs, 1003 complete and 0 interrupted iterations
compare   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m10.0s), 200/200 VUs, 1125 complete and 0 interrupted iterations
compare   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m11.0s), 200/200 VUs, 1273 complete and 0 interrupted iterations
compare   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m12.0s), 200/200 VUs, 1433 complete and 0 interrupted iterations
compare   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m13.0s), 200/200 VUs, 1588 complete and 0 interrupted iterations
compare   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m14.0s), 200/200 VUs, 1747 complete and 0 interrupted iterations
compare   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m15.0s), 200/200 VUs, 1878 complete and 0 interrupted iterations
compare   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m16.0s), 200/200 VUs, 2042 complete and 0 interrupted iterations
compare   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m17.0s), 200/200 VUs, 2215 complete and 0 interrupted iterations
compare   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m18.0s), 200/200 VUs, 2386 complete and 0 interrupted iterations
compare   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m19.0s), 200/200 VUs, 2552 complete and 0 interrupted iterations
compare   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m20.0s), 200/200 VUs, 2664 complete and 0 interrupted iterations
compare   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m21.0s), 200/200 VUs, 2821 complete and 0 interrupted iterations
compare   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m22.0s), 200/200 VUs, 2985 complete and 0 interrupted iterations
compare   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m23.0s), 200/200 VUs, 3130 complete and 0 interrupted iterations
compare   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m24.0s), 200/200 VUs, 3248 complete and 0 interrupted iterations
compare   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m25.0s), 200/200 VUs, 3394 complete and 0 interrupted iterations
compare   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m26.0s), 200/200 VUs, 3564 complete and 0 interrupted iterations
compare   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m27.0s), 200/200 VUs, 3736 complete and 0 interrupted iterations
compare   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m28.0s), 200/200 VUs, 3915 complete and 0 interrupted iterations
compare   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m29.0s), 200/200 VUs, 4080 complete and 0 interrupted iterations
compare   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m30.0s), 200/200 VUs, 4259 complete and 0 interrupted iterations
compare   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m31.0s), 200/200 VUs, 4428 complete and 0 interrupted iterations
compare   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m32.0s), 200/200 VUs, 4601 complete and 0 interrupted iterations
compare   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m33.0s), 200/200 VUs, 4770 complete and 0 interrupted iterations
compare   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m34.0s), 200/200 VUs, 4935 complete and 0 interrupted iterations
compare   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m35.0s), 200/200 VUs, 5091 complete and 0 interrupted iterations
compare   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m36.0s), 200/200 VUs, 5248 complete and 0 interrupted iterations
compare   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m37.0s), 200/200 VUs, 5413 complete and 0 interrupted iterations
compare   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m38.0s), 200/200 VUs, 5573 complete and 0 interrupted iterations
compare   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m39.0s), 200/200 VUs, 5734 complete and 0 interrupted iterations
compare   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m40.0s), 200/200 VUs, 5828 complete and 0 interrupted iterations
compare   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m41.0s), 200/200 VUs, 5920 complete and 0 interrupted iterations
compare   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m42.0s), 200/200 VUs, 5999 complete and 0 interrupted iterations
compare   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m43.0s), 200/200 VUs, 6038 complete and 0 interrupted iterations
compare   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m44.0s), 200/200 VUs, 6158 complete and 0 interrupted iterations
compare   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m45.0s), 200/200 VUs, 6298 complete and 0 interrupted iterations
compare   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m46.0s), 200/200 VUs, 6465 complete and 0 interrupted iterations
compare   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m47.0s), 200/200 VUs, 6637 complete and 0 interrupted iterations
compare   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m48.0s), 200/200 VUs, 6803 complete and 0 interrupted iterations
compare   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m49.0s), 200/200 VUs, 6956 complete and 0 interrupted iterations
compare   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m50.0s), 200/200 VUs, 7124 complete and 0 interrupted iterations
compare   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m51.0s), 200/200 VUs, 7290 complete and 0 interrupted iterations
compare   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m52.0s), 200/200 VUs, 7467 complete and 0 interrupted iterations
compare   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m53.0s), 200/200 VUs, 7635 complete and 0 interrupted iterations
compare   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m54.0s), 200/200 VUs, 7796 complete and 0 interrupted iterations
compare   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m55.0s), 200/200 VUs, 7946 complete and 0 interrupted iterations
compare   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m56.0s), 200/200 VUs, 8088 complete and 0 interrupted iterations
compare   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m57.0s), 200/200 VUs, 8214 complete and 0 interrupted iterations
compare   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m58.0s), 200/200 VUs, 8366 complete and 0 interrupted iterations
compare   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m59.0s), 200/200 VUs, 8525 complete and 0 interrupted iterations
compare   [  98% ] 200 VUs  0m59.0s/1m0s

running (1m00.0s), 200/200 VUs, 8686 complete and 0 interrupted iterations
compare   [ 100% ] 200 VUs  1m00.0s/1m0s

running (1m01.0s), 034/200 VUs, 8859 complete and 0 interrupted iterations
compare ↓ [ 100% ] 200 VUs  1m0s
time="2026-08-05T17:48:26+09:00" level=info msg="초기 재고: 99995393" source=console
time="2026-08-05T17:48:26+09:00" level=info msg="최종 재고: 99986500" source=console
time="2026-08-05T17:48:26+09:00" level=info msg="차감된 수량: 8893" source=console
time="2026-08-05T17:48:26+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_duration{scenario:compare}
    ✓ 'max>=0' max=4.87s

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    http_reqs{scenario:compare}
    ✓ 'count>=0' count=8893

    stock_decrease_successes{scenario:compare}
    ✓ 'count>=0' count=8893

    stock_lock_timeout_rate{scenario:compare}
    ✓ 'rate>=0' rate=0.00%

    stock_lock_timeouts{scenario:compare}
    ✓ 'count>=0' count=0

    stock_unexpected_failures
    ✓ 'count==0' count=0

      {scenario:compare}
      ✓ 'count>=0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 8893    145.363209/s
    checks_succeeded...: 100.00% 8893 out of 8893
    checks_failed......: 0.00%   0 out of 8893

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 8893   145.363209/s
      { scenario:compare }..........: 8893   145.363209/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 8893
      { scenario:compare }..........: 0.00%  0 out of 8893
    stock_lock_timeouts.............: 0      0/s
      { scenario:compare }..........: 0      0/s
    stock_unexpected_failure_rate...: 0.00%  0 out of 8893
    stock_unexpected_failures.......: 0      0/s
      { scenario:compare }..........: 0      0/s

    HTTP
    http_req_duration...............: avg=1.36s min=6.88ms med=1.24s max=4.87s p(90)=1.75s p(95)=2.33s p(99)=2.76s
      { expected_response:true }....: avg=1.36s min=6.88ms med=1.24s max=4.87s p(90)=1.75s p(95)=2.33s p(99)=2.76s
      { scenario:compare }..........: avg=1.36s min=6.88ms med=1.24s max=4.87s p(90)=1.75s p(95)=2.33s p(99)=2.76s
    http_req_failed.................: 0.00%  0 out of 8895
    http_reqs.......................: 8895   145.3959/s
      { scenario:compare }..........: 8893   145.363209/s

    EXECUTION
    iteration_duration..............: avg=1.36s min=7.03ms med=1.24s max=4.87s p(90)=1.75s p(95)=2.33s p(99)=2.76s
    iterations......................: 8893   145.363209/s
    vus.............................: 34     min=34        max=200
    vus_max.........................: 200    min=200       max=200

    NETWORK
    data_received...................: 5.3 MB 86 kB/s
    data_sent.......................: 1.7 MB 29 kB/s



running (1m01.2s), 000/200 VUs, 8893 complete and 0 interrupted iterations
compare ✓ [ 100% ] 200 VUs  1m0s